In [3]:
import pandas as pd
import sqlite3

In [4]:
cnn=sqlite3.connect('olympic.db')

In [5]:
df=pd.read_csv('athlete_eve.csv')
df.head(5)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,3,Gunnar Nielsen Aaby,M,24,170,75.0,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
1,4,Edgar Lindenau Aabye,M,34,163,107.0,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
2,502,Ahmad Shah Abouwi,M,53,169,128.0,Afghanistan,AFG,1956 Summer,1956,Summer,Melbourne,Hockey,Hockey Men's Hockey,NaN
3,717,Leopoldo Acosta,M,22,185,61.0,Ecuador,ECU,1984 Summer,1984,Summer,Los Angeles,Athletics,Athletics Men's 800 metres,NaN
4,734,Otto Mnsted Acthon,M,30,143,83.0,Denmark,DEN,1948 Summer,1948,Summer,London,Equestrianism,"Equestrianism Men's Jumping, Individual",NaN

In [6]:
df=pd.read_csv('noc_reg.csv')
df.head(5)

   NOC                    region  notes
0  AFG               Afghanistan    NaN
1  BAH                   Bahamas    NaN
2  CAF  Central African Republic    NaN
3  DEN                   Denmark    NaN
4  ECU                   Ecuador    NaN

In [21]:
df.to_sql('noc_reg',cnn)

9

In [ ]:
df.to_sql('athlete_eve',cnn)

In [18]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
%%sql

select * from athlete_eve;

In [23]:
%%sql

select * from noc_reg

 * sqlite:///olympic.db
Done.

[(0, 'AFG', 'Afghanistan', None),
 (1, 'BAH', 'Bahamas', None),
 (2, 'CAF', 'Central African Republic', None),
 (3, 'DEN', 'Denmark', None),
 (4, 'ECU', 'Ecuador', None),
 (5, 'FIJ', 'Fiji', None),
 (6, 'GAB', 'Gabon', None),
 (7, 'HAI', 'Haiti', None),
 (8, 'JAM', 'Jamaica', None)]

Q1-NUMBER OF ATHLETES BY GENDER

In [28]:
%%sql

select sex,count(*) 
from athlete_eve
group by sex;

 * sqlite:///olympic.db
Done.

[('F', 1362), ('M', 4301)]

 Q2-CITYWISE PARTICIPATION OF MALE & FEMALE ATHLETES

In [32]:
%%sql

select city,count(*) as Total,
sum(case when sex='M' then 1 else 0 end) as male,
sum(case when sex='F' then 1 else 0 end) as female
from athlete_eve
group by city
order by Total desc
limit 5;

 * sqlite:///olympic.db
Done.

[('London', 734, 553, 181),
 ('Rio de Janeiro', 376, 213, 163),
 ('Athina', 337, 217, 120),
 ('Los Angeles', 328, 248, 80),
 ('Atlanta', 322, 189, 133)]

Q3-NUMBER OF MALES & FEMALES WHO WON GOLD MEDALS

In [35]:
%%sql

select medal,
sum(case when sex='M' then 1 else 0 end) as gold_by_male,
sum(case when sex='F' then 1 else 0 end) as gold_by_female
from athlete_eve
where medal='Gold';

 * sqlite:///olympic.db
Done.

[('Gold', 173, 73)]

Q4-NUMBER OF MALES & FEMALES WHO WON SILVER MEDALS

In [36]:
%%sql

select medal,
sum(case when sex='M' then 1 else 0 end) as silver_by_male,
sum(case when sex='F' then 1 else 0 end) as silver_by_female
from athlete_eve
where medal='Silver';

 * sqlite:///olympic.db
Done.

[('Silver', 261, 69)]

Q5-NUMBER OF MALES & FEMALES WHO WON BRONZE MEDALS

In [38]:
%%sql

select medal,
sum(case when sex='M' then 1 else 0 end) as bronze_by_male,
sum(case when sex='F' then 1 else 0 end) as bronze_by_female
from athlete_eve
where medal='Bronze';

 * sqlite:///olympic.db
Done.

[('Bronze', 178, 65)]

Q6-NUMBER OF GOLD REGION/COUNTRY WISE

In [40]:
%%sql

select noc_reg.region,count(medal) as gold_medals
from athlete_eve
inner join noc_reg
on athlete_eve.noc=noc_reg.noc
where medal='Gold'
group by noc_reg.region;

 * sqlite:///olympic.db
Done.

[('Bahamas', 14),
 ('Denmark', 179),
 ('Ecuador', 1),
 ('Fiji', 13),
 ('Haiti', 1),
 ('Jamaica', 38)]

Q7-SEASON WISE PARTICIPATION OF ATHLETES wrt TEAMS

In [42]:
%%sql

select team,count(*) as p,
sum(case when season='Summer' then 1 else 0 end) as summer,

sum(case when season='Winter' then 1 else 0 end) as winter
from athlete_eve
group by team
order by p desc
limit 5;

 * sqlite:///olympic.db
Done.

[('Denmark', 3424, 3312, 112),
 ('Jamaica', 841, 814, 27),
 ('Bahamas', 348, 348, 0),
 ('Ecuador', 277, 277, 0),
 ('Fiji', 232, 228, 4)]

Q8-TEAM with MOST MEDALS

In [45]:
%%sql

select team,count(Medal) as Total_Medal
from athlete_eve
where medal in ('Gold','Silver','Bronze')
group by team
order by Total_Medal desc
limit 5;

 * sqlite:///olympic.db
Done.

[('Denmark', 553),
 ('Jamaica', 157),
 ('Bahamas', 36),
 ('Fiji', 13),
 ('Haiti', 6)]

Q9-YEARLY PARTICIPATION OF FEMALE ATHLETES

In [47]:
%%sql

select year,count(sex) as total
from athlete_eve
where sex='F'
group by year
order by total desc
limit 5;

 * sqlite:///olympic.db
Done.

[(2016, 163), (2012, 143), (1996, 133), (2004, 120), (2000, 120)]

Q10-YEARLY PARTICIPATION OF MALE ATHLETES

In [49]:
%%sql

select year,count(sex) as total
from athlete_eve
where sex='M'
group by year
order by total desc
limit 5;

 * sqlite:///olympic.db
Done.

[(1948, 268), (1920, 239), (1912, 231), (1972, 216), (1992, 214)]

Q11-CITYWISE TOTAL GAMES PLAYED

In [52]:
%%sql

select city,count(sport) as TOTAL_SPORTS_PLAYED
from athlete_eve
group by city
order by TOTAL_SPORTS_PLAYED desc
limit 5;

 * sqlite:///olympic.db
Done.

[('London', 734),
 ('Rio de Janeiro', 376),
 ('Athina', 337),
 ('Los Angeles', 328),
 ('Atlanta', 322)]

Q12-POPULAR SPORT OF WOMEN

In [54]:
%%sql

select sport,count(*) as sport
from athlete_eve
where sex='F'
group by sport
order by sport desc
limit 5;

 * sqlite:///olympic.db
Done.

[('Athletics', 542),
 ('Swimming', 286),
 ('Handball', 59),
 ('Equestrianism', 53),
 ('Badminton', 50)]

Q13-POPULAR SPORT OF MEN

In [55]:
%%sql

select sport,count(*) as sport
from athlete_eve
where sex='M'
group by sport
order by sport desc
limit 5;

 * sqlite:///olympic.db
Done.

[('Athletics', 926),
 ('Cycling', 381),
 ('Gymnastics', 311),
 ('Shooting', 289),
 ('Sailing', 267)]